feat: update the architectture diagram to use mermaid
